////////////////////////////////////////////////////////////////////////////////
// Подсистема "Удаленное администрирование".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при завершении сеанса средствами подсистемы ЗавершениеРаботыПользователей.
// 
// Параметры:
//  ФормаВладелец - УправляемаяФорма, из которой выполняется завершение сеанса,
//  НомерСеанса - Число (8,0,+) - номер сеанса, который будет завершен,
//  СтандартнаяОбработка - Булево, флаг выполнения стандартной обработки завершения сеанса
//    (подключение к агенту сервера через COM-соединение или сервер администрирования с
//    запросом параметров подключения к кластеру у текущего пользователя). Может быть
//    установлен в значение Ложь внутри обработчика события, в этом случае стандартная
//    обработка завершения сеанса выполняться не будет.
//
Процедура ПриЗавершенииСеанса(ФормаВладелец, Знач НомерСеанса, СтандартнаяОбработка) Экспорт
	
	Если СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().РазделениеВключено Тогда
		
		Если СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ДоступноИспользованиеРазделенныхДанных Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("НомерСеанса", НомерСеанса);
			
			ОткрытьФорму("ОбщаяФорма.ЗавершениеСеансаВМоделиСервиса",
				ПараметрыФормы,
				ФормаВладелец,
				НомерСеанса,
				,
				,
				,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
