
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем мВерсияОтчета Экспорт;
Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
		
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);
	
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2015УФ";
	НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 № 14'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 № 14'");
	НоваяФорма.ДатаНачалоДействия = '2015-01-01';
	НоваяФорма.ДатаКонецДействия  = '2016-11-30';
		
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2016УФ";
	НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 № 14 (в редакции приказа Минфина от 26.09.2016 г. N 841)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 № 14 (у редакції наказу Мінфина від 26.09.2016 р. N 841)'");
	НоваяФорма.ДатаНачалоДействия = '2016-12-01';
	НоваяФорма.ДатаКонецДействия  = '2017-06-30';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2017УФ";
	НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 23.01.2015 № 14 (в редакции приказа Минфина от 26.09.2016 г. N 841, с изменениями согласно приказа Минфина от 24.04.2017 г. №451)'; uk = 'Затверджена наказом Мінфіна від 23.01.2015 № 14 (у редакції наказу Мінфина від 26.09.2016 р. N 841 зі змінами згідно наказу Мінфну від 24.04.2017 г. №451)'");
	НоваяФорма.ДатаНачалоДействия = '2017-07-01';
	НоваяФорма.ДатаКонецДействия  = Неопределено;
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

мВерсияОтчета = "БП 2.0.6.1.1";

#КонецЕсли
