
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ МЕХАНИЗМА РАСШИФРОВКИ
//


// Процедура выводит форму расшифровки.
// 
// Пример:
// 	Если ИДОтчета = "РегламентированныйОтчетБухОтчетность" Тогда
//		Если ИДРедакцииОтчета = "ФормаОтчета2011Кв1" Тогда
//			ОткрытьРасшифровкуБухОтчетностьФормаОтчета2011Кв1(ИДИменПоказателей, ПараметрыОтчета);
//		КонецЕсли;
// 	КонецЕсли;
//
Процедура ОткрытьРасшифровкуОтчета(ИДОтчета, ИДРедакцииОтчета, ИДИменПоказателей, ПараметрыОтчета) Экспорт
	
	ПараметрыФормы = КопияСтруктуры(ПараметрыОтчета);
	ПараметрыФормы.Вставить("ИДИменПоказателей", ИДИменПоказателей);
	
	ЗаголовокРасшифровкиДляВсегоРаздела = НаименованиеРасшифровки(ПолучитьНаименованиеОтчетаДляРасшифровки(ИдОтчета),
		ПараметрыОтчета.мДатаНачалаПериодаОтчета, ПараметрыОтчета.мДатаКонцаПериодаОтчета);
		
	Если ПараметрыОтчета.Свойство("НаимТекущегоРаздела") Тогда
		ИмяРаздела = ПараметрыОтчета.НаимТекущегоРаздела;
	Иначе	
		ИмяРаздела = Неопределено;
	КонецЕсли;
	
	Если НЕ РегламентированнаяОтчетностьВызовСервера.ЕстьРасшифровкаПоПоказателям(ПараметрыОтчета.АдресВременногоХранилищаРасшифровки, ИДИменПоказателей, ИмяРаздела) Тогда
		ТекстВопроса = НСтр("ru='Для выбранной ячейки расшифровка не существует."
"Показать расшифровку для всех показателей формы?';uk='Для вибраної комірки розшифровка не існує."
"Показати розшифровку для всіх показників форми?'");
		ДополнительныеПараметры = Новый Структура("ЗаголовокРасшифровкиДляВсегоРаздела, ПараметрыФормы", ЗаголовокРасшифровкиДляВсегоРаздела, ПараметрыФормы);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьРасшифровкуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		Если НЕ ИДРедакцииОтчета = Истина Тогда
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Нет);	
		КонецЕсли;
	Иначе
		ПоказатьРасшифровкуВсехПоказателейФормы(ЗаголовокРасшифровкиДляВсегоРаздела, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьРасшифровкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаголовокРасшифровкиДляВсегоРаздела = ДополнительныеПараметры.ЗаголовокРасшифровкиДляВсегоРаздела;
	ПараметрыФормы = ДополнительныеПараметры.ПараметрыФормы;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПоказатьРасшифровкуВсехПоказателейФормы(ЗаголовокРасшифровкиДляВсегоРаздела, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПоказатьРасшифровкуВсехПоказателейФормы(ЗаголовокРасшифровкиДляВсегоРаздела, ПараметрыФормы)
	
	ПараметрыФормы.Вставить("ЗаголовокРасшифровки", ЗаголовокРасшифровкиДляВсегоРаздела);
	
	ФормаРасшифровки = ПолучитьФорму("ОбщаяФорма.РасшифровкаПоказателейРегламентированныхОтчетов", ПараметрыФормы, , Истина);
	ФормаРасшифровки.Открыть();
	
КонецПроцедуры


Функция НаименованиеРасшифровки(НаименованиеОтчета, НачалоПериода, КонецПериода)
	
	ПериодОтчета = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
	
	ПредставлениеОтчета = НаименованиеОтчета;
	Если НаименованиеОтчета = "РегламентированныйОтчетДекларацияОПрибыли" Тогда
		ПредставлениеОтчета = НСТР("ru='Декларация о прибыли';uk='Декларація про прибуток'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчет6ПВ" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет по количеству работников';uk='Звіт по кількості працівників'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетБаланс" Тогда
		ПредставлениеОтчета = НСТР("ru='Баланс (стандарт № 2)';uk='Баланс (стандарт № 2)'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетБалансМП" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет МП (стандарт № 25)';uk='Звіт МП (стандарт № 25)'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетБалансМПС" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет МП сокращенный (стандарт № 25)';uk='Звіт МП скорочений (стандарт № 25)'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетДвижениеДенежныхСредств" Тогда
		ПредставлениеОтчета = НСТР("ru='Движение денежных средств (стандарт № 4)';uk='Рух грошових коштів (стандарт № 4)'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетДекларацияАкцизногоНалога" Тогда
		ПредставлениеОтчета = НСТР("ru='Декларация по Акцизному налогу';uk='Декларація з Акцизного податку'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетДекларацияНДС" Тогда
		ПредставлениеОтчета = НСТР("ru='Декларация по НДС';uk='Декларація з ПДВ'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетЕдиныйСоциальныйВзнос" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет по Единому социальному взносу';uk='Звіт по Єдиному соціальному внеску'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетЗанятостьГражданСДопГарантиями" Тогда
		ПредставлениеОтчета = НСТР("ru='Информация о занятости и трудоустройстве граждан, имеющих дополнительные гарантии в содействии трудоустройству';uk='Інформація про зайнятість та працевлаштування громадян, що мають додаткові гарантії у сприянні працевлаштуванню'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетОбОбъемахРеализованныхУслуг" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет об объемах реализованных услуг (форма №1-услуги)';uk='Звіт про обсяги реалізованих послуг (форма №1-послуги)'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетОСобственномКапитале" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет о собственном капитале';uk='Звіт про власний капітал'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетОСуммахДебиторскойИКредиторскойЗадолженности" Тогда
		ПредставлениеОтчета = НСТР("ru='Форма № 1-Б. Отчет о взаиморасчетах с нерезидентами (отчет о суммах дебиторской и кредиторской задолженности, Отчет о финансовых результатах)';uk='Форма № 1-Б Звіт про взаєморозрахунки з нерезидентами (звіт про суми дебіторської та кредиторської заборгованості, Звіт про фінансові результати)'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетОСуммахПолученныхЛьготВНалогообложении" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет о суммах полученных льгот в налогообложении';uk='Звіт про суми отриманих пільг в оподатковуванні'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетПоТруду" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет по труду';uk='Звіт по праці'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетУточняющийРасчетДекларацияНДС" Тогда
		ПредставлениеОтчета = НСТР("ru='Уточняющий расчет по НДС';uk='Уточнюючий розрахунок по ПДВ'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетФинансовыйРезультат" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет о финансовых результатах (стандарт № 3)';uk='Звіт про фінансові результати (стандарт № 3)'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетФорма1ДФ" Тогда
		ПредставлениеОтчета = НСТР("ru='Расчетная ведомость по форме № 1ДФ';uk='Розрахункова відомість за формою № 1ДФ'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетФорма5" Тогда
		ПредставлениеОтчета = НСТР("ru='Примечания к финансовой отчетности (форма № 5)';uk='Примітки до фінансової звітності (форма № 5)'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетФСС" Тогда
		ПредставлениеОтчета = НСТР("ru='Отчет в ФСС от временной утраты трудоспособности';uk='Звіт у ФСС від тимчасової втрати працездатності'");
	ИначеЕсли  НаименованиеОтчета = "РегламентированныйОтчетФССНесчастныйСлучай" Тогда
		ПредставлениеОтчета = НСТР("ru='Ведомость распределения численности работников';uk='Відомість розподілу чисельності працівників'");
	КонецЕсли;	
	
	Возврат ПредставлениеОтчета + " " + ПериодОтчета + НСТР("ru=' - расшифровка значений показателей';uk=' - розшифровка значень показників'");
	
КонецФункции


Функция КопияСтруктуры(ИсходнаяСтруктура)
	
	Результат = Новый Структура;
	
	Для Каждого Элемент Из ИсходнаяСтруктура Цикл
		Результат.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьНаименованиеОтчетаДляРасшифровки(ИдОтчета)

	Возврат ИДОтчета	

КонецФункции // ()

// Процедура открывает форму списка задач бухгалтера.
//
Процедура ОткрытьКалендарь(Владелец, Организация, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиПоНавигационнойСсылке(ЗадачиБухгалтераКлиентСервер.СсылкаНаИТС());
	
КонецПроцедуры
