////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки", расширение безопасного режима.
// Процедуры и функции с повторным использованием возвращаемых значений.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает массив методов, которые могут быть выполнены расширением безопасного
// режима.
//
// Возвращаемое значение: Массив(Строка).
//
Функция ПолучитьРазрешенныеМетоды() Экспорт
	
	Результат = Новый Массив();
	
	// ДополнительныеОтчетыИОбработкиВБезопасномРежиме
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЧтениеXMLИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЗаписьXMLВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЧтениеHTMLИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЗаписьHTMLВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЧтениеFastInfosetИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ЗаписьFastInfosetВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.СоздатьComОбъект");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПодключитьВнешнююКомпонентуИзОбщегоМакетаКонфигурации");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПодключитьВнешнююКомпонентуИзМакетаКонфигурации");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПолучитьФайлИзВнешнегоОбъекта");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПередатьФайлВоВнешнийОбъект");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПолучитьФайлИзИнтернета");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПередатьФайлВИнтернет");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.WSСоединение");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПроведениеДокументов");
	// ДополнительныеОтчетыИОбработкиВБезопасномРежиме
	
	// ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ТекстовыйДокументИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ТекстовыйДокументВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ТабличныйДокументИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ТабличныйДокументВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ФорматированныйДокументВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.СтрокаИзДвоичныхДанных");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.СтрокаВДвоичныеДанные");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.РаспаковатьАрхив");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.УпаковатьФайлыВАрхив");
	Результат.Добавить("ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера.ВыполнитьСценарийВБезопасномРежиме");
	// Конец ДополнительныеОтчетыИОбработкиВБезопасномРежимеВызовСервера
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

// Возвращает словарь синонимов видов разрешений дополнительных отчетов и обработок
// и их параметров (для отображения в пользовательском интерфейсе).
//
// Возвращаемое значение:
//  ФиксированноеСоответствие:
//    Ключ - ТипXDTO, соответствующий виду разрешения,
//    Значение - Структура, ключи:
//      Представление - строка, краткое представление вида разрешения,
//      Описание - строка, подробное описание вида разрешения,
//      Параметры - ТаблицаЗначений, колонки:
//        Имя - строка, имя свойства, определенного для ТипаXDTO,
//        Описание - строка, описание последствий параметра разрешения для
//          указанного значения параметра,
//        ОписаниеЛюбогоЗначения - строка, описание последствий параметра
//          разрешения для неуказанного значения параметра.
//
Функция Словарь() Экспорт
	
	Результат = Новый Соответствие();
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}GetFileFromInternet
	
	Представление = НСтр("ru='Получение данных из сети Интернет';uk='Одержання даних з мережі Інтернет'");
	Описание = НСтр("ru='Дополнительному отчету или обработке будет разрешено получать данные из сети Интернет';uk='Додатковому звіту або обробці буде дозволено одержувати дані з мережі Інтернет'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "Host", НСтр("ru='с сервера %1';uk='с сервера %1'"), НСтр("ru='с любого сервера';uk='с будь-якого сервера'"));
	ДобавитьПараметр(Параметры, "Protocol", НСтр("ru='по протоколу %1';uk='по протоколу %1'"), НСтр("ru='по любому протоколу';uk='по будь-якому протоколі'"));
	ДобавитьПараметр(Параметры, "Port", НСтр("ru='через порт %1';uk='через порт %1'"), НСтр("ru='через любой порт';uk='через будь-який порт'"));
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПолучениеДанныхИзИнтернет(),
		Новый Структура(
			"Представление,Описание,Параметры",
			Представление,
			Описание,
			Параметры));
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}GetFileFromInternet
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToInternet
	
	Представление = НСтр("ru='Передача данных в сеть Интернет';uk='Передача даних у мережу Інтернет'");
	Описание = НСтр("ru='Дополнительному отчету или обработке будет разрешено отправлять данные в сеть Интернет';uk='Додатковому звіту або обробці буде дозволено відправляти дані в мережу Інтернет'");
	Последствия = НСтр("ru='Внимание! Отправка данных потенциально может использоваться дополнительным"
"отчетом или обработкой для совершения действий, не предполагаемых администратором"
"информационной базы."
""
"Используйте данный дополнительный отчет или обработку только в том случае, если Вы доверяете"
"ее разработчику и контролируйте ограничения (сервер, протокол и порт), накладываемые на"
"выданные разрешения.';uk='Увага! Відправлення даних потенційно може використовуватися додатковим"
"звітом або обробкою для здійснення дій, не передбачуваних адміністратором"
"інформаційної бази."
""
"Використовуйте даний додатковий звіт або обробку тільки в тому випадку, якщо Ви довіряєте"
"її розробнику та контролюйте обмеження (сервер, протокол і порт), що накладаються на"
"видані дозволи.'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "Host", НСтр("ru='на сервер %1';uk='на сервер %1'"), НСтр("ru='на любой сервера';uk='на будь-який сервера'"));
	ДобавитьПараметр(Параметры, "Protocol", НСтр("ru='по протоколу %1';uk='по протоколу %1'"), НСтр("ru='по любому протоколу';uk='по будь-якому протоколі'"));
	ДобавитьПараметр(Параметры, "Port", НСтр("ru='через порт %1';uk='через порт %1'"), НСтр("ru='через любой порт';uk='через будь-який порт'"));
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПередачаДанныхВИнтернет(),
		Новый Структура(
			"Представление,Описание,Последствия,Параметры",
			Представление,
			Описание,
			Последствия,
			Параметры));
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToInternet
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SoapConnect
	
	Представление = НСтр("ru='Обращение к веб-сервисам в сети Интернет';uk='Звертання до веб-сервисам у мережі Інтернет'");
	Описание = НСтр("ru='Дополнительному отчету или обработке будет разрешено обращаться к веб-сервисам, расположенным в сети Интернет (при этом возможно как получение дополнительным отчетом или обработкой информации из сети Интернет, так и передача.';uk='Додатковому звіту або обробці буде дозволено звертатися до веб-сервісам, розташованим у мережі Інтернет (при цьому можливо як одержання додатковим звітом або обробкою інформації з мережі Інтернет, так і передача.'");
	Последствия = НСтр("ru='Внимание! Обращение к веб-сервисам потенциально может использоваться дополнительным"
"отчетом или обработкой для совершения действий, не предполагаемых администратором"
"информационной базы."
""
"Используйте данный дополнительный отчет или обработку только в том случае, если Вы доверяете"
"ее разработчику и контролируйте ограничения (адрес подключения), накладываемые на"
"выданные разрешения.';uk='Увага! Звертання до сервісів-веб-сервісів потенційно може використовуватися додатковим"
"звітом або обробкою для здійснення дій, не передбачуваних адміністратором"
"інформаційної бази."
""
"Використовуйте даний додатковий звіт або обробку тільки в тому випадку, якщо Ви довіряєте"
"її розробнику та контролюйте обмеження (адреса підключення), що накладаються на"
"видані дозволи.'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "WsdlDestination", НСтр("ru='по адресу %1';uk='за адресою %1'"), НСтр("ru='по любому адресу';uk='по будь-якій адресі'"));
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипWSСоединение(),
		Новый Структура(
			"Представление,Описание,Последствия,Параметры",
			Представление,
			Описание,
			Последствия,
			Параметры));
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SoapConnect
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}CreateComObject
	
	Представление = НСтр("ru='Создание COM-объекта';uk=""Створення COM-об'єкта""");
	Описание = НСтр("ru='Дополнительному отчету или обработке будет разрешено использовать механизмы внешнего программного обеспечения с помощью COM-соединения';uk=""Додатковому звіту або обробці буде дозволено використовувати механізми зовнішнього програмного забезпечення за допомогою COM-з'єднання""");
	Последствия = НСтр("ru='Внимание! Использование средств стороннего программного обеспечения может использоваться"
"дополнительным отчетом или обработкой для совершения действий, не предполагаемых администратором"
"информационной базы, а также для несанкционированного обхода ограничений, накладываемых на дополнительную обработку"
"в безопасном режиме."
""
"Используйте данный дополнительный отчет или обработку только в том случае, если Вы доверяете"
"ее разработчику и контролируйте ограничения (программный идентификатор), накладываемые на"
"выданные разрешения.';uk='Увага! Використання коштів стороннього програмного забезпечення може використовуватися"
"додатковим звітом або обробкою для здійснення дій, не передбачуваних адміністратором"
"інформаційної бази, а також для несанкціонованого обходу обмежень, що накладаються на додаткову обробку"
"у безпечному режимі."
""
"Використовуйте даний додатковий звіт або обробку тільки в тому випадку, якщо Ви довіряєте"
"її розробнику та контролюйте обмеження (програмний ідентифікатор), що накладаються на"
"видані дозволи.'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "ProgId", НСтр("ru='с программным идентификатором %1';uk='с програмним ідентифікатором %1'"), НСтр("ru='с любым программным идентификатором';uk='с будь-яким програмним ідентифікатором'"));
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипСозданиеCOMОбъекта(),
		Новый Структура(
			"Представление,Описание,Последствия,Параметры",
			Представление,
			Описание,
			Последствия,
			Параметры));
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}CreateComObject
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}AttachAddin
	
	Представление = НСтр("ru='Создание объекта внешней компоненту';uk=""Створення об'єкта зовнішньої компоненту""");
	Описание = НСтр("ru='Дополнительному отчету или обработке будет разрешено использовать механизмы внешнего программного обеспечения с помощью создания объекта внешней компоненты, поставляемой в макете конфигурации';uk=""Додатковому звіту або обробці буде дозволено використовувати механізми зовнішнього програмного забезпечення за допомогою створення об'єкта зовнішнього компонента, що поставляє в макеті конфігурації""");
	Последствия = НСтр("ru='Внимание! Использование средств стороннего программного обеспечения может использоваться"
"дополнительным отчетом или обработкой для совершения действий, не предполагаемых администратором"
"информационной базы, а также для несанкционированного обхода ограничений, накладываемых на дополнительную обработку"
"в безопасном режиме."
""
"Используйте данный дополнительный отчет или обработку только в том случае, если Вы доверяете"
"ее разработчику и контролируйте ограничения (имя макета, из которого выполняется подключение внешней"
"компоненты), накладываемые на выданные разрешения.';uk=""Увага! Використання коштів стороннього програмного забезпечення може використовуватися"
"додатковим звітом або обробкою для здійснення дій, не передбачуваних адміністратором"
"інформаційної бази, а також для несанкціонованого обходу обмежень, що накладаються на додаткову обробку"
"у безпечному режимі."
""
"Використовуйте даний додатковий звіт або обробку тільки в тому випадку, якщо Ви довіряєте"
"її розробнику та контролюйте обмеження (ім'я макета, з якого виконується підключення зовнішньої"
"компоненти), що накладаються на видані дозволи.""");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "TemplateName", НСтр("ru='из макета %1';uk='з макета %1'"), НСтр("ru='из любого макета';uk='з будь-якого макета'"));
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПодключениеВнешнейКомпоненты(),
		Новый Структура(
			"Представление,Описание,Последствия,Параметры",
			Представление,
			Описание,
			Последствия,
			Параметры));
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}AttachAddin
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}GetFileFromExternalSoftware
	
	Представление = НСтр("ru='Получение файлов из внешнего объекта';uk=""Одержання файлів із зовнішнього об'єкта""");
	Описание = НСтр("ru='Дополнительному отчету или обработке будет разрешено получать файлы из внешнего программного обеспечения (например, с помощью COM-соединения или внешней компоненты)';uk=""Додатковому звіту або обробці буде дозволено одержувати файли із зовнішнього програмного забезпечення (наприклад, за допомогою COM-з'єднання або зовнішнього компонента)""");
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПолучениеФайлаИзВнешнегоОбъекта(),
		Новый Структура(
			"Представление,Описание",
			Представление,
			Описание));
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}GetFileFromExternalSoftware
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToExternalSoftware
	
	Представление = НСтр("ru='Передача файлов во внешний объект';uk=""Передача файлів у зовнішній об'єкт""");
	Описание = НСтр("ru='Дополнительному отчету или обработке будет разрешено передавать файлы во внешнее программное обеспечение (например, с помощью COM-соединения или внешней компоненты)';uk=""Додатковому звіту або обробці буде дозволено передавати файли в зовнішнє програмне забезпечення (наприклад, за допомогою COM-з'єднання або зовнішнього компонента)""");
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПередачаФайлаВоВнешнийОбъект(),
		Новый Структура(
			"Представление,Описание",
			Представление,
			Описание));
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToExternalSoftware
	
	// {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToInternet
	
	Представление = НСтр("ru='Проведение документов';uk='Проведення документів'");
	Описание = НСтр("ru='Дополнительному отчету или обработке будет разрешено изменять состояние проведенности документов';uk='Додатковому звіту або обробці буде дозволено змінювати стан проведення документів'");
	
	Параметры = ТаблицаПараметров();
	ДобавитьПараметр(Параметры, "DocumentType", НСтр("ru='документы с типом %1';uk='документи з типом %1'"), НСтр("ru='любые документы';uk='будь-які документи'"));
	ДобавитьПараметр(Параметры, "Action", НСтр("ru='разрешенное действие: %1';uk='дозволена дія: %1'"), НСтр("ru='любое изменение состояния проведения';uk='будь-яка зміна стану проведення'"));
	
	Результат.Вставить(
		ДополнительныеОтчетыИОбработкиВБезопасномРежимеИнтерфейс.ТипПроведениеДокументов(),
		Новый Структура(
			"Представление,Описание,Параметры,ОтображатьПользователю",
			Представление,
			Описание,
			Параметры));
	
	// Конец {http://www.1c.ru/1cFresh/ApplicationExtensions/Permissions/a.b.c.d}SendFileToInternet
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПараметр(Знач ТаблицаПараметров, Знач Имя, Знач Описание, Знач ОписаниеЛюбогоЗначения)
	
	Параметр = ТаблицаПараметров.Добавить();
	Параметр.Имя = Имя;
	Параметр.Описание = Описание;
	Параметр.ОписаниеЛюбогоЗначения = ОписаниеЛюбогоЗначения;
	
КонецПроцедуры

Функция ТаблицаПараметров()
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОписаниеЛюбогоЗначения", Новый ОписаниеТипов("Строка"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
