////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информация при запуске"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определение настроек отображения информации при запуске.
//
// Параметры:
//   Настройки - Коллекция настроек подсистемы. Реквизиты:
//       * Показывать - Булево - Показывать ли информацию в текущем сеансе.
//           - Истина - Информация будет показана после входа в программу.
//           - Ложь - Информация не будет показана.
//
Процедура ОпределитьНастройки(Настройки) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организация.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организация";
	Если Запрос.Выполнить().Пустой() Тогда
		
		Настройки.Показывать = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
