
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Макет = ПланыОбмена.ОбменРозница20Бухгалтерия20.ПолучитьМакет("ПодробнаяИнформация");
	
	ПолеHTMLДокумента = Макет.ПолучитьТекст();
	
	Заголовок = НСтр("ru='Информация о синхронизации данных конфигураций Розница для Украины ред. 2.0 и Бухгалтерия для Украины ред. 2.0';uk='Інформація про синхронізації даних конфігурацій Роздріб для України ред. 2.0 і Бухгалтерія для України ред. 2.0'");

КонецПроцедуры

#КонецОбласти