
// Хранение контекста взаимодействия с сервисом
&НаКлиенте
Перем КонтекстВзаимодействия Экспорт;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнтернетПоддержкаПользователейКлиент.ОбработатьОткрытиеФормы(КонтекстВзаимодействия, ЭтотОбъект);
	
	ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
	
	Если ТипЗнч(ОсновныеПараметры) = Тип("Структура")
		И ОсновныеПараметры.Свойство("МестоЗапуска") Тогда
		
		Если ОсновныеПараметры.МестоЗапуска = "handStartNew"
			ИЛИ ОсновныеПараметры.МестоЗапуска = "systemStartNew" Тогда
			Элементы.Декорация1.Заголовок = НСтр("ru='Показ информационного окна недоступен для этой конфигурации.';uk='Показ інформаційного вікна недоступний для цієї конфігурації.'");
			
			
		Иначе
			Элементы.Декорация1.Заголовок = НСтр("ru='Выбранное действие недоступно для этой конфигурации.';uk='Вибрана дія недоступна для цієї конфігурації.'");
			
		КонецЕсли;
		
	Иначе
		
		Элементы.Декорация1.Заголовок = НСтр("ru='Выбранное действие недоступно для этой конфигурации.';uk='Вибрана дія недоступна для цієї конфігурації.'");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти