
// Хранение контекста взаимодействия с сервисом
&НаКлиенте
Перем КонтекстВзаимодействия Экспорт;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	МестоЗапуска = Параметры.МестоЗапуска;
	
	// Сформировать шаблон письма в зависимости от переданных праметров
	СформироватьПисьмо(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнтернетПоддержкаПользователейКлиент.ОбработатьОткрытиеФормы(КонтекстВзаимодействия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	// Проверка заполнения полей
	Если ПустаяСтрока(ЭлектроннаяПочта) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = НСтр("ru='Поле ""E-mail для обратной связи"" не заполнено.';uk='Поле ""E-mail для зворотного зв''язку"" не заповнено.'");
		СообщениеПользователю.Поле  = "ЭлектроннаяПочта";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Тема) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = НСтр("ru='Поле ""Тема сообщения"" не заполнено.';uk='Полі ""Тема повідомлення"" не заповнено.'");
		СообщениеПользователю.Поле  = "Тема";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Сообщение) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = НСтр("ru='Не заполнен тест письма.';uk='Не заповнений тест листа.'");
		СообщениеПользователю.Поле  = "Сообщение";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура("ОтКого, Тема, Сообщение", ЭлектроннаяПочта, Тема, Сообщение);
	Если НЕ ПустаяСтрока(УсловноеИмяПолучателя) Тогда
		ПараметрыПисьма.Вставить("УсловноеИмяПолучателя", УсловноеИмяПолучателя);
	КонецЕсли;
	
	Состояние(НСтр("ru='Отправка';uk='Відправлення'")
		,
		,
		НСтр("ru='Выполняется отправка электронного письма в службу тех. поддержки.';uk='Надсилання електронного листа в службу тех. підтримки.'"),
		БиблиотекаКартинок.ИнтернетПоддержкаПользователейОтправкаПисьма);
	
	РезультатОтправки = ИнтернетПоддержкаПользователейКлиент.ОтправитьЭлектронноеСообщениеСлужбеТехПоддержки(
		ПараметрыПисьма,
		КонтекстВзаимодействия);
	
	Состояние();
	
	Если НЕ РезультатОтправки Тогда
		ПоказатьПредупреждение(,
			НСтр("ru='При отправке письма произошла ошибка."
"Подробнее см. в журнале регистрации.';uk='При відправленні листа сталася помилка."
"Докладніше див. у журналі реєстрації.'"));
	Иначе
		Закрыть();
		ПоказатьПредупреждение(, НСтр("ru='Сообщение успешно отправлено.';uk='Повідомлення успішно відправлено.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет заполнение шаблона письма в зависимости от значения параметров.
//
// Параметры:
// - Параметры (ДанныеФормыСтруктура, Структура) - параметры формирования шаблона.
//
&НаСервере
Процедура СформироватьПисьмо(Параметры)
	
	ШаблонЗаголовка = НСтр("ru='Письмо будет отправлено в техподдержку пользователей на адрес %1';uk='Лист буде відправлено в техпідтримку користувачів на адресу %1'");
	EMailДляОтправки = "webits-info@1c.ua";
	
	ТекстТехПараметров = ТекстТехническихПараметров();
	
	ТекстСообщения = "";
	
	ЛогинПользователя = "";
	Если НЕ Параметры.Свойство("Логин", ЛогинПользователя) Тогда
		Параметры.Свойство("login", ЛогинПользователя);
	КонецЕсли;
	
	// Формирование письма по шаблону в зависимотси от типа сообщения
	Если Параметры.ТипСообщения = 1 Тогда
		
		Тема           = НСтр("ru='Интернет-поддержка. Авторизация.';uk='Інтернет-підтримка. Авторизація.'");
		ТекстСообщения = НСтр("ru='Здравствуйте!"
"У меня не получается пройти авторизацию и подключить интернет-поддержку."
"Логин и пароль мной введены правильно. Прошу помочь разобраться с проблемой."
""
"Логин: %1."
""
"%2"
"-----------------------------------------------"
"С уважением, .';uk='Доброго дня!"
"У мене не виходить пройти авторизацію і підключити інтернет-підтримку."
"Логін і пароль мною введено правильно. Прошу допомогти розібратися з проблемою."
""
"Логін: %1."
""
"%2"
"-----------------------------------------------"
"З повагою, .'");
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ЛогинПользователя,
			ТекстТехПараметров);
		
	ИначеЕсли Параметры.ТипСообщения = 2 Тогда
		
		Тема = НСтр("ru='Интернет-поддержка. Ввод регистрационного номера.';uk='Інтернет-підтримка. Введення реєстраційного номера.'");
		ТекстСообщения = НСтр("ru='Здравствуйте!"
"У меня не получается ввести регистрационный номер программного продукта"
"для подключения интернет-поддержки."
"Прошу помочь разобраться с проблемой."
""
"Логин: %1."
"Регистрационный номер: %2."
""
"%3"
"-----------------------------------------------"
"С уважением, .';uk='Доброго дня!"
"У мене не виходить ввести реєстраційний номер програмного продукту"
"для підключення інтернет-підтримки."
"Прошу допомогти розібратися з проблемою."
""
"Логін: %1."
"Реєстраційний номер: %2."
""
"%3"
"-----------------------------------------------"
"З повагою, .'");
		
		Если Параметры.Свойство("regnumber") Тогда
			РегНомер = Параметры.regnumber;
		Иначе
			РегНомер = "";
		КонецЕсли;
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ЛогинПользователя,
			РегНомер,
			ТекстТехПараметров);
		
	ИначеЕсли Параметры.ТипСообщения = 3 Тогда
		
		Тема = НСтр("ru='Интернет-поддержка. Регистрация продукта.';uk='Інтернет-підтримка. Реєстрація продукту.'");
		ТекстСообщения = НСтр("ru='Здравствуйте!"
"У меня не получается зарегистрировать программный продукт"
"для подключения интернет-поддержки. Прошу помочь разобраться с проблемой."
""
"Логин: %1."
"Регистрационный номер: %2."
"Пинкод: %3."
""
"%4"
"-----------------------------------------------"
"С уважением, ';uk='Доброго дня!"
"У мене не виходить зареєструвати програмний продукт"
"для підключення інтернет-підтримки. Прошу допомогти розібратися з проблемою."
""
"Логін: %1."
"Реєстраційний номер: %2."
"Пінкод: %3."
""
"%4"
"-----------------------------------------------"
"З повагою, '");
		
		Если Параметры.Свойство("regnumber") Тогда
			РегНомер = Параметры.regnumber;
		Иначе
			РегНомер = "";
		КонецЕсли;
		
		Если Параметры.Свойство("pincode") Тогда
			ПинКод = Параметры.pincode;
		Иначе
			ПинКод = "";
		КонецЕсли;
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ЛогинПользователя,
			РегНомер,
			Пинкод,
			ТекстТехПараметров);
		
	ИначеЕсли Параметры.ТипСообщения = 4 Тогда
		
		Тема = НСтр("ru='Интернет-поддержка. Ввод дополнительной информации о пользователе.';uk='Інтернет-підтримка. Введення додаткової інформації про користувача.'");
		ТекстСообщения = Нстр("ru='Здравствуйте!"
"У меня не получается ввести дополнительную информацию о моей организации"
"при подключении интернет-поддержки. Прошу помочь разобраться с проблемой."
""
"Логин: %1"
"Название организации: %2"
"Тип деятельности: %3"
"ИНН: %4"
"Код ЕДРПОУ: %5"
"Руководитель: %6"
"Телефон: %7"
"Адрес электронной почты: %8"
"Факс: %9';uk='Доброго дня!"
"У мене не виходить ввести додаткову інформацію про моєї організації"
"при підключенні інтернет-підтримки. Прошу допомогти розібратися з проблемою."
""
"Логін: %1"
"Назва організації: %2"
"Тип діяльності: %3"
"ІПН: %4"
"Код ЄДРПОУ: %5"
"Керівник: %6"
"Телефон: %7"
"Адреса електронної пошти: %8"
"Факс: %9'");
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ЛогинПользователя,
			Параметры.НазваниеОрганизации,
			Параметры.ТипОсновнойДеятельности,
			Параметры.ИНН,
			Параметры.КПП,
			Параметры.РуководительОрганизации,
			Параметры.Телефон,
			Параметры.АдресЭлектроннойПочты,
			Параметры.Факс);
		
		ТекстСообщенияПродолжение = НСтр("ru='Адрес: %1"
"Место покупки: %2"
"Дата покупки: %3"
"Число рабочих мест: %4"
"Ответственный сотрудник: %5"
""
"%6"
"-----------------------------------------------"
"С уважением, .';uk='Адреса: %1"
"Місце покупки: %2"
"Дата покупки: %3"
"Кількість робочих місць: %4"
"Відповідальний співробітник: %5"
""
"%6"
"-----------------------------------------------"
"З повагою, .'");
		
		ТекстСообщенияПродолжение = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщенияПродолжение,
			Параметры.ПредставлениеАдреса,
			Параметры.ГдеПриобретенаПрограмма,
			Формат(Параметры.ДатаПриобретения, "Л=ru_RU; ДФ=dd.MM.yyyy; ДЛФ=D"),
			Параметры.ЧислоРабочихМест,
			Параметры.ОтветственныйЗаРаботуСПакетом,
			ТекстТехПараметров);
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстСообщенияПродолжение;
		
	ИначеЕсли Параметры.ТипСообщения = 5 Тогда
		
		Тема = НСтр("ru='Интернет-поддержка. Интернет-поддержка продукта не оказывается.';uk='Інтернет-підтримка. Інтернет-підтримка продукту не надається.'");
		ТекстСообщения = НСтр("ru = 'Здравствуйте!
			|При подключении интернет-поддержки этого программного продукта
			|мне выдается сообщение 'Интернет-поддержка продукта не оказывается'.
			|Прошу помочь разобраться с проблемой.
			|
			|%1
			|-----------------------------------------------
			|С уважением, .'");
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ТекстТехПараметров);
		
	ИначеЕсли Параметры.ТипСообщения = 6 Тогда
		
		Тема = НСтр("ru='Интернет-поддержка. Восстановление пароля.';uk='Інтернет-підтримка. Відновлення пароля.'");
		ТекстСообщения = НСтр("ru='Здравствуйте!"
"У меня не получается восстановить свой пароль для подключения"
"интернет-поддержки."
"Прошу помочь разобраться с проблемой."
""
"Логин: %1."
"E-mail: %2."
""
"%3"
"-----------------------------------------------"
"С уважением, .';uk='Доброго дня!"
"У мене не виходить відновити свій пароль для підключення"
"інтернет-підтримки."
"Прошу допомогти розібратися з проблемою."
""
"Логін: %1."
"E-mail: %2."
""
"%3"
"-----------------------------------------------"
"З повагою, .'");
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ЛогинПользователя,
			Параметры.ЭлектроннаяПочта,
			ТекстТехПараметров);
		
	ИначеЕсли Параметры.ТипСообщения = 7 Тогда
		
		Тема = НСтр("ru='Интернет-поддержка. Регистрация программного продукта.';uk='Інтернет-підтримка. Реєстрація програмного продукту.'");
		ТекстСообщения = НСтр("ru='Здравствуйте!"
"У меня не получается зарегистрировать программный продукт"
"для подключения интернет-поддержки. Прошу помочь разобраться с проблемой."
""
"Регистрационный номер: %1"
"Пинкод: %2."
""
"%3"
"-----------------------------------------------"
"С уважением, .';uk='Доброго дня!"
"У мене не виходить зареєструвати програмний продукт"
"для підключення інтернет-підтримки. Прошу допомогти розібратися з проблемою."
""
"Реєстраційний номер: %1"
"Пінкод: %2."
""
"%3"
"-----------------------------------------------"
"З повагою, .'");
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			Параметры.РегистрационныйНомер,
			Параметры.ПинКод,
			ТекстТехПараметров);
		
	ИначеЕсли Параметры.ТипСообщения = 8 Тогда
		
		Тема = НСтр("ru='Интернет-поддержка. Регистрация нового пользователя.';uk='Інтернет-підтримка. Реєстрація нового користувача.'");
		ТекстСообщения = Нстр("ru='Здравствуйте!"
"У меня не получается зарегистрировать нового пользователя"
"для подключения интернет-поддержки. Прошу помочь разобраться с проблемой."
""
"Логин: %1"
"E-mail: %2"
"Фамилия: %3"
"Имя: %4"
"Отчество: %5"
"Город: %6"
"Телефон: %7"
"Место работы: %8."
""
"%9"
"-----------------------------------------------"
"С уважением, .';uk=""Доброго дня!"
"У мене не виходить зареєструвати нового користувача"
"для підключення інтернет-підтримки. Прошу допомогти розібратися з проблемою."
""
"Логін: %1"
"E-mail: %2"
"Прізвище: %3"
"Ім'я: %4"
"По батькові: %5"
"Місто: %6"
"Телефон: %7"
"Місце роботи: %8."
""
"%9"
"-----------------------------------------------"
"З повагою, .""");
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ЛогинПользователя,
			Параметры.Email,
			Параметры.Фамилия,
			Параметры.Имя,
			Параметры.Отчетсво,
			Параметры.Город,
			Параметры.Телефон,
			Параметры.МестоРаботы,
			ТекстТехПараметров);
		
		
	ИначеЕсли Параметры.ТипСообщения = 13 Тогда
		
		Тема = НСтр("ru='Интернет-поддержка. Проблемы с обновлением конфигурации.';uk='Інтернет-підтримка. Проблеми з оновленням конфігурації.'");
		ТекстСообщения = Нстр("ru='Здравствуйте."
"При обновлении конфигурации на новый релиз возникли следующие проблемы:"
""
""
"Логин: %1"
"Регистрационный номер: %2"
""
"%3"
"-----------------------------------------------"
"С уважением, .';uk='Доброго дня."
"При оновленні конфігурації на новий реліз виникли наступні проблеми:"
""
""
"Логін: %1"
"Реєстраційний номер: %2"
""
"%3"
"-----------------------------------------------"
"З повагою, .'");
		
		Если Параметры.Свойство("regnumber") Тогда
			РегНомер = Параметры.regnumber;
		Иначе
			РегНомер = "";
		КонецЕсли;
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ЛогинПользователя,
			РегНомер,
			ТекстТехПараметров);
		
	Иначе
		
		Тема = НСтр("ru='<Укажите тему сообщения>';uk='<Укажіть тему повідомлення>'");
		ТекстСообщения = НСтр("ru='<Заполните содержимое письма>,"
""
"Логин: %1"
"С уважением, .';uk='<Заповніть вміст листа>,"
""
"Логін: %1"
"З повагою, .'");
		
		ТекстСообщения = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстСообщения,
			ЛогинПользователя,
			РегНомер);
		
	КонецЕсли;
	
	Элементы.ПояснениеКЗаголовку.Заголовок = СтрЗаменить(ШаблонЗаголовка, "%1", EMailДляОтправки);
	
	Сообщение = ТекстСообщения;
	
КонецПроцедуры

// Формирует шаблон текста технических параметров.
//
// Возвращаемое значение - Строка - шаблон технических параметров.
//
&НаСервере
Функция ТекстТехническихПараметров()
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Если МестоЗапуска = "systemStart" ИЛИ МестоЗапуска = "systemStartNew" Тогда
		МестоВызоваСервиса = НСтр("ru='автоматический';uk='автоматичний'");
	Иначе
		МестоВызоваСервиса = НСтр("ru='ручной';uk='ручний'");
	КонецЕсли;
	
	ТехническиеПараметры = НСтр("ru='Технические параметры подключения:"
"(нужны для воспроизведения описанной проблемы)"
""
"- имя конфигурации: %1,"
"- номер версии конфигурации: %2,"
"- номер версии платформы: %3,"
"- версия библиотеки интернет-поддержки: %4,"
"- язык пользователя: %5,"
"- вид приложения: управляемый,"
"- вызов сервиса: %6."
"';uk=""Технічні параметри підключення:"
"(потрібні для відтворення описаної проблеми)"
""
"- ім'я конфігурації: %1,"
"- номер версії конфігурації: %2,"
"- номер версії платформи: %3,"
"- версія бібліотеки інтернет-підтримки: %4,"
"- мова користувача: %5,"
"- вид додатка: керований,"
"- виклик сервісу: %6."
"""");
	
	ТехническиеПараметры = ИнтернетПоддержкаПользователейКлиентСервер.ПодставитьПараметрыВСтроку(
		ТехническиеПараметры,
		Строка(Метаданные.Имя),
		Строка(Метаданные.Версия),
		Строка(СисИнфо.ВерсияПриложения),
		ИнтернетПоддержкаПользователейКлиентСервер.ВерсияБиблиотеки(),
		ТекущийКодЛокализации(),
		МестоВызоваСервиса);
	
	Возврат ТехническиеПараметры;
	
КонецФункции




#КонецОбласти
