#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПоУмолчанию() Экспорт
	Возврат ПолучитьСпособОкругления(БезОкругления().Наименование, БезОкругления().Точность)
КонецФункции	

//////////////////////////////////////////////////////////////////
/// Первоначальное заполнение и обновление информационной базы

Процедура НачальноеЗаполнение() Экспорт
	
	ПолучитьСпособОкругления(БезОкругления().Наименование, БезОкругления().Точность);
	
	ПолучитьСпособОкругления("Округление до рубля", 1);
	
	ПолучитьСпособОкругления("Округление до десяти рублей",	10);
	ПолучитьСпособОкругления("Округление до ста рублей",	100);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция БезОкругления()
	Возврат Новый Структура("Наименование, Точность", "Без округления", 0.01)
КонецФункции

Функция ПолучитьСпособОкругления(Наименование, Точность);
	
	СпособОкругления = НайтиПоНаименованию(Наименование, Истина);
	
	Если СпособОкругления = ПустаяСсылка() Тогда
		НовыйЭлемент = СоздатьЭлемент();
		НовыйЭлемент.Наименование = Наименование;
		НовыйЭлемент.Точность = Точность;
		НовыйЭлемент.Записать();
		СпособОкругления = НовыйЭлемент.Ссылка;
	КонецЕсли;	
	
	Возврат СпособОкругления
	
КонецФункции


#КонецЕсли