
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru='Просмотр сведений о пользователе %1 не доступен, т.к. это "
"служебная учетная запись, предусмотренная для администраторов сервиса.';uk='Перегляд відомостей про користувача %1 не доступний, т. я. це "
"службовий обліковий запис, передбачений для адміністраторів сервісу.'");
	Элементы.НеразделенныйПользователь.Заголовок = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Параметры.Ключ.Наименование);
	
КонецПроцедуры
