////////////////////////////////////////////////////////////////////////////////
// Подсистема "Валюты"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается при запуске конфигурации, подключает обработчик ожидания.
//
Процедура ПриНачалеРаботыСистемы(Парам) Экспорт
	Параметры = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();
	Если Параметры.Свойство("Валюты") И Параметры.Валюты.КурсыОбновляютсяОтветственными Тогда
		ПодключитьОбработчикОжидания("РаботаСКурсамиВалютВывестиОповещениеОНеактуальности", 15, Истина);
	КонецЕсли;
	
	ПоказРекламыЗагрузкиКурсовВалютФинансУАПриСтартеСистемы();
КонецПроцедуры

Процедура ПоказРекламыЗагрузкиКурсовВалютФинансУАПриСтартеСистемы() Экспорт
	Если РаботаСКурсамиВалютВызовСервера.ПоказатьРекламуЗагрузкиКурсовВалютФинансУА() Тогда	
		//ОткрытьФорму("Обработка.ЗагрузкаКурсовВалют.Форма.ФормаОжидания");
		ОткрытьФорму("ОбщаяФорма.ФормаРекламыФинансУА");
	КонецЕсли;	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Обновление курсов валют

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКурсыУстарели() Экспорт
	
	ПоказатьОповещениеПользователя(
		НСтр("ru='Курсы валют устарели';uk='Курси валют застаріли'"),
		НавигационнаяСсылкаОбработки(),
		НСтр("ru='Обновить курсы валют';uk='Оновити курси валют'"),
		БиблиотекаКартинок.Предупреждение32);
	
КонецПроцедуры

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКурсыУспешноОбновлены() Экспорт
	
	ПоказатьОповещениеПользователя(
		НСтр("ru='Курсы валют успешно обновлены';uk='Курси валют успішно оновлені'"),
		НавигационнаяСсылкаОбработки(),
		НСтр("ru='Курсы валют обновлены';uk='Курси валют оновлені'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

// Выводит соответствующее оповещение.
//
Процедура ОповеститьКурсыАктуальны() Экспорт
	
	ПоказатьОповещениеПользователя(
		НСтр("ru='Курсы валют уже обновлены';uk='Курси валют уже оновлені'"),
		НавигационнаяСсылкаОбработки(),
		НСтр("ru='Курсы валют актуальны';uk='Курси валют актуальні'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

// Возвращает навигационную ссылку для оповещений.
//
Функция НавигационнаяСсылкаОбработки()
	Возврат "e1cib/app/Обработка.ЗагрузкаКурсовВалют";
КонецФункции
