#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("Обработка.НачальноеЗаполнениеИОбновлениеОбъектов.Форма.ЗаполнениеСинонимовОбъектов",
	             ПараметрыФормы, 
				 ПараметрыВыполненияКоманды.Источник, 
	             "Обработка.НачальноеЗаполнениеИОбновлениеОбъектов.Форма.ЗаполнениеСинонимовОбъектов" + ?(ПараметрыВыполненияКоманды.Окно = Неопределено, ".ОтдельноеОкно", ""), 
				 ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти
