#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, ИмяРеквизита, ЗначениеПоУмолчанию)

	Если НЕ ДанныеЗаполнения.Свойство(ИмяРеквизита, ЗаписьРегистра[ИмяРеквизита]) Тогда
		ЗаписьРегистра[ИмяРеквизита] = ЗначениеПоУмолчанию;
	КонецЕсли;

КонецПроцедуры

Процедура УстановкаНастройкиПечатиНалоговыхНакладныхПоУмолчанию(ЗаписьРегистра, ДанныеЗаполнения) Экспорт

	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "Организация", БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "Период", НачалоГода(ТекущаяДатаСеанса()));
	
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВыводитьНомерДоговораБезКлеточек", 							Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН", 	Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "НеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах", 		Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПечататьДатыВНалоговыхНакладныхСРазделителями", 				Ложь);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПечататьКодУКТВЭДБезПробелов", 								Истина);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ПечататьТитульныйЛистДляПриложения2КНалоговойНакладной", 	Ложь);
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "СимволПустыхПоказателейВНалоговойНакладной", 				" ");
	УстановитьЗначениеРеквизита(ЗаписьРегистра, ДанныеЗаполнения, "ВыгрузкаПечатьНН_ПоФормеНаДатуДокумента", 					Ложь);
	
КонецПроцедуры

#КонецЕсли
