////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Логин") Тогда 
		Логин = Параметры.Логин;
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторПожелания") Тогда 
		ИдентификаторПожелания = Параметры.ИдентификаторПожелания;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Отправить(Команда)
	
	Если ПустаяСтрока(Комментарий) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Комментарий не может быть пустым';uk='Коментар не може бути порожнім'"));
		Возврат;
	КонецЕсли;
	
	ПослеОтправки = Новый ОписаниеОповещения("ПослеОтправки", ЭтотОбъект);
	
	Результат = ДобавитьКомментрий();
	Если Результат Тогда
		ПоказатьОповещениеПользователя(НСтр("ru='Комментарий добавлен.';uk='Коментар доданий.'"));
		ВыполнитьОбработкуОповещения(ПослеОтправки);
	Иначе
		ПоказатьПредупреждение(ПослеОтправки, НСтр("ru='Комментарий не добавлен. Повторите попытку позднее.';uk='Коментар не доданий. Повторіть спробу пізніше.'"));
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ДобавитьКомментрий()
	
	ПроксиИнформационногоЦентра = ИнформационныйЦентрСервер.ПолучитьПроксиИнформационногоЦентра_1_0_1_2();
	ФабрикаXDTOВебСервиса       = ПроксиИнформационногоЦентра.ФабрикаXDTO;
	ОписаниеКомментария         = ПривестиКОбъектуXDTOКомментарийПользователя(ФабрикаXDTOВебСервиса);
	
	Возврат ПроксиИнформационногоЦентра.AddCommentSuggestion(ОписаниеКомментария);
	
КонецФункции

&НаСервере
Функция ПривестиКОбъектуXDTOКомментарийПользователя(ФабрикаXDTOВебСервиса)
	
	ТипКомментария      = ФабрикаXDTOВебСервиса.Тип("http://www.1c.ru/SaaS/1.0/XMLSchema/ManageInfoCenter_1_0_1_2", "CommentListElement");
	ОписаниеКомментария = ФабрикаXDTOВебСервиса.Создать(ТипКомментария);
	
	ОписаниеКомментария.Text           = Комментарий;
	ОписаниеКомментария.Date           = ТекущаяДата(); // Проектное решение БСП
	ОписаниеКомментария.Author         = Логин;
	ОписаниеКомментария.RefSuggestion  = ИдентификаторПожелания;
	ОписаниеКомментария.Vote           = 0;
	
	Возврат ОписаниеКомментария;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтправки(Знач ДополнительныеПараметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры