////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление конфигурации"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устарела. Следует использовать ПриОпределенииКраткогоИмениКонфигурации
//
Функция КороткоеИмяКонфигурации() Экспорт
	
	АдресРесурсовОбозревателя = "AccountingUkr";
	Если Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0 Тогда
		АдресРесурсовОбозревателя = АдресРесурсовОбозревателя + "Base";
	ИначеЕсли Найти(ВРег(Метаданные.Имя), "КОРП") > 0 Тогда
		АдресРесурсовОбозревателя = АдресРесурсовОбозревателя + "Corp";
	КонецЕсли;
	
	Возврат АдресРесурсовОбозревателя;
	
КонецФункции

// Определяет короткое имя (идентификатор) конфигурации.
//
// Параметры:
//	КраткоеИмя - Строка- короткое имя конфигурации.
//
Процедура ПриОпределенииКраткогоИмениКонфигурации(КраткоеИмя) Экспорт
	
	КраткоеИмя = "AccountingUkr";
	Если Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0 Тогда
		КраткоеИмя = КраткоеИмя + "Base";
	ИначеЕсли Найти(ВРег(Метаданные.Имя), "КОРП") > 0 Тогда
		КраткоеИмя = КраткоеИмя + "Corp";
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Следует использовать ПриОпределенииАдресаСервераДляПроверкиНаличияОбновления
//
Функция АдресСервераДляПроверкиНаличияОбновления() Экспорт
	
	Возврат "downloads.1c.eu";
	
КонецФункции

// Получает адрес веб-сервера поставщика конфигурации, на котором находится
// информация о доступных обновлениях ("открытая" часть веб-сайта).
//
// Параметры:
//	АдресСервера - Строка - адрес веб-сервера.
//
// Примеры реализации:
//	АдресСервера = "localhost";  // локальный веб-сервер для тестирования
//
Процедура ПриОпределенииАдресаСервераДляПроверкиНаличияОбновления(АдресСервера) Экспорт
	
	АдресСервера = "downloads.1c.eu";
	
КонецПроцедуры

// Устарела. Следует использовать ПриОпределенииАдресаРесурсаДляПроверкиНаличияОбновления
//
Функция АдресРесурсаДляПроверкиНаличияОбновления() Экспорт
	
	Возврат "/ipp/ITSREPV/V8Update/Configs/";
	
КонецФункции

// Получить адрес ресурса на веб-сервере для проверки наличия обновлений
// (на "открытой" части веб-сайта).
//
// Параметры:
//	АдресРесурса - Строка - Адрес ресурса для проверки наличия обновления
//
Процедура ПриОпределенииАдресаРесурсаДляПроверкиНаличияОбновления(АдресРесурса) Экспорт
	АдресРесурса = "/ipp/ITSREPV/V8Update/Configs/";
КонецПроцедуры

// Устарела. Следует использовать ПриОпределенииКаталогаОбновлений
//
Функция КаталогОбновлений() Экспорт
	
	Возврат Метаданные.АдресКаталогаОбновлений;
	
КонецФункции

// Получает адрес веб-сайта с каталогом обновлений ("закрытая" часть веб-сайта).
//
// Параметры:
//	АдресКаталогаОбновлений - Строка - Адрес каталога обновлений
//
// Примеры реализации:
//	АдресКаталогаОбновлений = "localhost/tmplts/"; // локальный веб-сервер для тестирования 
//
Процедура ПриОпределенииАдресаКаталогаОбновлений(АдресКаталогаОбновлений) Экспорт
	
	АдресКаталогаОбновлений = Метаданные.АдресКаталогаОбновлений;
	
КонецПроцедуры

#КонецОбласти
