
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Пользователь = Параметры.Пользователь;
	ПарольПользователяСервиса = Параметры.ПарольПользователяСервиса;
	СтараяПочта = Параметры.СтараяПочта;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗапросНаСменуПочты()
	
	ПользователиСлужебный.ПриСозданииЗапросаНаСменуПочты(НоваяПочта, Пользователь, ПарольПользователяСервиса);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьПочту(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "";
	Если Не ЗначениеЗаполнено(СтараяПочта) Тогда
		ТекстВопроса =
			НСтр("ru='Адрес электронной почты пользователя сервиса изменен."
"Владельцы и администраторы абонента больше не смогут изменять параметры пользователя.';uk='Адреса електронної пошти користувача сервісу змінений."
"Власники й адміністратори абонента більше не зможуть змінювати параметри користувача.'")
			+ Символы.ПС
			+ Символы.ПС;
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru='Выполнить изменение адреса электронной почты?';uk='Виконати зміну адреси електронної пошти?'");
	
	ПоказатьВопрос(
		Новый ОписаниеОповещения("СменитьПочтуЗавершение", ЭтотОбъект),
		ТекстВопроса,
		РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьПочтуЗавершение(Ответ, Неопределен) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		СоздатьЗапросНаСменуПочты();
		
		ПоказатьПредупреждение(
			Новый ОписаниеОповещения("Закрыть", ЭтотОбъект),
			НСтр("ru='На указанный адрес отправлено письмо с запросом на подтверждение."
"Почта будет изменена только после подтверждения запроса пользователем.';uk='На зазначену адресу відправлений лист із запитом на підтвердження."
"Пошта буде змінена тільки після підтвердження запиту користувачем.'"));
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
