#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Возращает коэффициент для единицы измерения по определенной номенклатуре используя
// данные регистра "Единицы измерения". Если в регистре для данной единицы не указан
// коэффициент - значение коэффициента устанавливается равным 1.
//
Функция ПолучитьКоэффициентЕдиницыИзмерения(Номенклатура, ЕдиницаИзмерения) Экспорт
	
	ЕдиницаИзмеренияНоменклатуры = Номенклатура.ЕдиницыИзмерения.Найти(ЕдиницаИзмерения, "ЕдиницаИзмерения");									  
	
	Если ЕдиницаИзмеренияНоменклатуры = Неопределено Тогда
		Коэффициент	= 1;
	Иначе
		Коэффициент = ЕдиницаИзмеренияНоменклатуры.Коэффициент;	
	КонецЕсли;

	Если Коэффициент = 0 Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции  

#КонецОбласти

#КонецЕсли