&НаКлиенте
Процедура ОткрытьСайтФинансУа() Экспорт
	ЗапуститьПриложение("http://1c.finance.ua");
КонецПроцедуры

&НаКлиенте
Процедура ПолеКартинкиФинансУаНажатие(Элемент)
	ОткрытьСайтФинансУа();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсыВалют(Команда)
	ЗагрузитьКурсыВалютСервер();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалютСервер()
	РаботаСКурсамиВалют.ЗагрузитьАктуальныйКурс();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Сохраним настройку пользователя о показе рекламы
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ЗагрузкаКурсовВалют", "ДатаПоказаРекламы", НачалоДня(ТекущаяДата()));
КонецПроцедуры
